1m3_27mm_wall_H2_test_02/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);  

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    front
    {
        type            fixedValue;
        value           uniform (0 0.01 0); 
    }
    back
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    bottom_wall
    {
        type            noSlip;
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
        phi             phi;
    }
    nozzle_27mm_5mm_m
    {
        type            noSlip;
    }
    nozzle
    {
        type            flowRateInletVelocity; //fixedValue;
        volumetricFlowRate  
        {        
            type            csvFile;
            file            "$FOAM_CASE/constant/vfr_H2_half.csv"; 
            nHeaderLine     1;          // number of header lines (1 if you have "time,massFlowRate")
            refColumn       0;          // column with time values
            componentColumns (1);       // column with mass flow rate values (scalar, so one column)
            separator       ",";        // comma-separated
            mergeSeparators no;
            outOfBounds     clamp;      // or repeat, warn, error – clamp is safe
        }
        value           $internalField;  // or uniform (0 0 0);
        rho             rho;
        rhoInlet        8.6e-2;     // keep your estimate if needed at start-up
    }
    box_shell_m  //wall
    {
        type            noSlip;
    }
}
// ************************************************************************* //
