1m3_27mm_wall_H2_test_02/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient; //fixedFluxPressure;
    }
    front
    {
        type            zeroGradient; //fixedFluxPressure;
    }
    back
    {
        type            fixedValue; // zeroGradient;
        value           $internalField;
    }
    bottom_wall
    {
        type            fixedFluxPressure; //zeroGradient;
    }
    top
    {
        type            zeroGradient; //fixedFluxPressure;
    }
    nozzle_27mm_5mm_m
    {
        type            fixedFluxPressure; //zeroGradient;
    }
    nozzle
    {
        type            fixedFluxPressure; //zeroGradient;
    }
    box_shell_m
    {
        type            fixedFluxPressure; //zeroGradient;
    }
}
// ************************************************************************* //
